src/InformationRegisters/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Файлы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>CatalogRef.КлючиСтрок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Файлы/ManagerModule.bsl
Процедура ЗаписатьФайл ( Параметры ) Экспорт
	
	набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей ();
	набор.Отбор.Объект.Установить ( Параметры.Объект );
	набор.Отбор.КлючСтроки.Установить ( Параметры.КлючСтроки );
	набор.Прочитать ();
	набор.Очистить ();
	запись = набор.Добавить ();
	ЗаполнитьЗначенияСвойств ( запись, Параметры );
	п = получитьПредставления ( Параметры );
	запись.Папка = п.Папка;
	набор.Записать ();
	записатьФайлНаДиск  ( Параметры.Адрес, запись, п.Ключ );
	
КонецПроцедуры

Функция получитьПредставления ( Параметры )
	
	имя = Параметры.Объект.Метаданные ().Имя;
	с = "
	|выбрать
	|	Док.Номер как Объект,
	|	Ключи.Код как КлючСтроки
	|из
	|	Документ." + имя + " как Док,
	|	Справочник.КлючиСтрок как Ключи
	|где
	|	Док.Ссылка = &Объект
	|	и Ключи.Ссылка = &КлючСтроки
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Объект", Параметры.Объект );
	запрос.УстановитьПараметр ( "КлючСтроки", Параметры.КлючСтроки );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	п = Новый Структура ();
	п.Вставить ( "Папка", ( имя + выборка.Объект ) );
	п.Вставить ( "Ключ", выборка.КлючСтроки );
	Возврат п;

КонецФункции

Процедура записатьФайлНаДиск ( Адрес, Запись, Ключ )
	
	данные = ПолучитьИзВременногоХранилища ( Адрес );
	путь = Константы.ХранениеФайлов.Получить () + Запись.Папка;
	СоздатьКаталог ( путь );
 	данные.Записать ( путь + "\" + ПолучитьПрефиксКлюча ( Ключ ) + запись.ИмяФайла );
	Если ( ЭтоАдресВременногоХранилища ( Адрес ) ) Тогда
		УдалитьИзВременногоХранилища ( Адрес ); 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПрефиксКлюча ( Ключ ) Экспорт
	
	Возврат ( "КЛЮЧ_" + Формат ( Ключ, "ЧГ=0;" ) + " " );

КонецФункции

Процедура УдалитьЗапись ( Параметры ) Экспорт
	
	набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей ();
	набор.Отбор.Объект.Установить ( Параметры.Объект );
	набор.Отбор.КлючСтроки.Установить ( Параметры.КлючСтроки );
	набор.Прочитать ();
	Если ( набор.Количество () > 0 ) Тогда
		папка = набор [ 0 ].Папка;
		УдалитьФайлПоЗаписи ( набор [ 0 ] );
		удалитьПапку ( папка );
	КонецЕсли;
	набор.Очистить ();
	набор.Записать ();
			
КонецПроцедуры

Процедура УдалитьФайлПоЗаписи ( Запись )
	
	путь = Константы.ХранениеФайлов.Получить () + Запись.Папка;
	полноеИмя = путь + "\" + ПолучитьПрефиксКлюча ( Запись.КлючСтроки ) + Запись.ИмяФайла;
	УдалитьФайлы ( полноеИмя );
			
КонецПроцедуры

Процедура удалитьПапку ( Папка )
	
	// код ...
	
КонецПроцедуры
